src/DataProcessors/ИС_WB_СозданиеНоменклатурыПоТоварамWildberries.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ИС_WB_СозданиеНоменклатурыПоТоварамWildberries</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ДанныеДляСозданияНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НоменклатураWB</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИС_WB_Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазмерНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИС_WB_РазмерыНоменклатур</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеНоменклатуры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеХарактеристики</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИС_WB_Категории</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/ИС_WB_СоответствиеРазмеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_WB_СоответствиеРазмеров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазмерWB</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_РазмерыНоменклатур</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_WB_ШтрихкодыРазмеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_WB_ШтрихкодыРазмеров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_РазмерыНоменклатур</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ШтрихкодыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ШтрихкодыНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/ИС_WB_РазмерыНоменклатур.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ИС_WB_РазмерыНоменклатур</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ИС_WB_Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>price</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>techSize</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>wbSize</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Номенклатура</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/ИС_WB_СозданиеНоменклатурыПоТоварамWildberries/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Ивонин К.А. 02.08.24 УА #80685
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	ИС_MP_Сервер.ПриСозданииНаСервере(ЭтотОбъект);
	Элементы.СоздаватьХарактеристики.Видимость = Константы.ИспользоватьХарактеристикиНоменклатуры.Получить();
	ЗаполнитьСписокВыбораФормированияНаименования();
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 02.08.24 УА #80685

#КонецОбласти

#Область ОбработчикиКомандФормы   

//+ ИнфоСофт Сумин Д.В. 22.02.23 УА #55507
&НаКлиенте
Процедура ЗаполнитьДанные(Команда) 
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо выбрать профиль.", , , "Профиль");
		Возврат;
	КонецЕсли;	
	
	ЗаполнитьДанныеНаСервере();
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 22.02.23 УА #55507 

//+ ИнфоСофт Сумин Д.В. 22.02.23 УА #55507
&НаКлиенте
Процедура СоздатьНоменклатуру(Команда)  
	
	Структурапроверки = ПроверкаЗаполненияНаПустыеЗначения(); 
	
	Если Структурапроверки.ПустыеЗначения Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Структурапроверки.Текст);
		Возврат;
	КонецЕсли;
	
	Если СоздаватьХарактеристики Тогда
		Счетчик = СоздатьНоменклатуруСХарактеристиками();	
	Иначе	
		Счетчик = СоздатьНоменклатуруБезХарактеристик();
	КонецЕсли; 
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выполнение обработки завершено. Обработано " + Счетчик + " объектов");  
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 22.02.23 УА #55507 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

#Область ПодготовкаДанных 

//+ ИнфоСофт Сумин Д.В. 22.02.23 УА #55507
&НаСервере
Процедура ЗаполнитьДанныеНаСервере()
	
	Объект.ДанныеДляСозданияНоменклатуры.Очистить();
	
	ДанныеДляСозданияТЗ = ПолучитьДанныеДляСозданияНаСервере(); 
	
	Если ДанныеДляСозданияТЗ.Количество() < 1 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данных для создания номенклатуры не найдено.");
		Возврат;
		
	КонецЕсли;
	
	Если СоздаватьХарактеристики Тогда
		ЗаполнитьТаблицуДанныхСХарактеристиками(ДанныеДляСозданияТЗ);	
	Иначе
		ЗаполнитьТаблицуДанныхБезХарактеристик(ДанныеДляСозданияТЗ);	
	КонецЕсли;	
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 22.02.23 УА #55507 

//+ ИнфоСофт Сумин Д.В. 22.02.23 УА #55507
&НаСервере
Функция ПолучитьДанныеДляСозданияНаСервере()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИС_WB_РазмерыНоменклатур.Владелец.Ссылка КАК НоменклатураВБ,
	|	ИС_WB_РазмерыНоменклатур.Ссылка КАК РазмерНоменклатуры
	|ПОМЕСТИТЬ ВТ_ОсновныеДанные
	|ИЗ
	|	Справочник.ИС_WB_РазмерыНоменклатур КАК ИС_WB_РазмерыНоменклатур
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
	|		ПО (ИС_WB_РазмерыНоменклатур.Ссылка = ИС_WB_СоответствиеРазмеров.РазмерWB)
	|ГДЕ
	|	ИС_WB_СоответствиеРазмеров.РазмерWB ЕСТЬ NULL
	|	И ИС_WB_РазмерыНоменклатур.Профиль = &Профиль
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ИС_WB_ШтрихкодыРазмеров.Штрихкод) КАК Штрихкод,
	|	ВТ_ОсновныеДанные.РазмерНоменклатуры КАК РазмерНоменклатуры
	|ПОМЕСТИТЬ ВТ_Штрихкод
	|ИЗ
	|	ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_ШтрихкодыРазмеров КАК ИС_WB_ШтрихкодыРазмеров
	|		ПО ВТ_ОсновныеДанные.РазмерНоменклатуры = ИС_WB_ШтрихкодыРазмеров.Размер
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОсновныеДанные.РазмерНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОсновныеДанные.НоменклатураВБ КАК НоменклатураВБ,
	|	ВТ_ОсновныеДанные.РазмерНоменклатуры КАК РазмерНоменклатуры,
	|	ВТ_Штрихкод.Штрихкод КАК Штрихкод
	|ИЗ
	|	ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Штрихкод КАК ВТ_Штрихкод
	|		ПО ВТ_ОсновныеДанные.РазмерНоменклатуры = ВТ_Штрихкод.РазмерНоменклатуры";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции //- ИнфоСофт Сумин Д.В. 22.02.23 УА #55507

//+ ИнфоСофт Ивонин К.А. 02.08.24 УА #80685
&НаСервере
Процедура ЗаполнитьТаблицуДанныхБезХарактеристик(ДанныеДляСозданияТЗ) 
	
	Для Каждого Элемент Из ДанныеДляСозданияТЗ Цикл	
		Наименование = ПолучитьНаименованиеИзНоменклатуры(Элемент.НоменклатураВБ, Элемент.РазмерНоменклатуры); 		
		ЗаполнитьТЧДанных(Элемент, Наименование);	
	КонецЦикла;	
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 02.08.24 УА #80685 

//+ ИнфоСофт Сумин Д.В. 22.02.23 УА #55507
&НаСервере
Процедура ЗаполнитьТаблицуДанныхСХарактеристиками(ДанныеДляСозданияТЗ)
	
	Для Каждого Элемент Из ДанныеДляСозданияТЗ Цикл
		
		НаименованиеНоменклатуры = ПолучитьНаименованиеИзНоменклатуры(Элемент.НоменклатураВБ, Элемент.РазмерНоменклатуры);
		
		Если ИспользоватьВНаименованииРоссийскийРазмер Тогда
			НаименованиеХарактеристики = Элемент.РазмерНоменклатуры.wbSize;	
		Иначе
			НаименованиеХарактеристики = Элемент.РазмерНоменклатуры.techSize;	
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(НаименованиеХарактеристики) Или СокрЛП(НаименованиеХарактеристики) = "0" Тогда
			НаименованиеХарактеристики = Элемент.РазмерНоменклатуры.наименование;	
		КонецЕсли;	
		
		ЗаполнитьТЧДанных(Элемент, НаименованиеНоменклатуры, НаименованиеХарактеристики)
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 22.02.23 УА #55507

//+ ИнфоСофт Ивонин К.А. 02.08.24 УА #80685
&НаСервере
Функция ПолучитьНаименованиеИзНоменклатуры(Номенклатура, Размер)
	
	Наименование = ""; 
	
	Характеристки = Номенклатура.Характеристики;
	
	Для Каждого Элемент Из Объект.Номенклатура Цикл
		
		Если Элемент.НаименованиеПоля = "Наименование" Тогда
			Наименование = Наименование + " " + Номенклатура.Наименование;	
		ИначеЕсли Элемент.НаименованиеПоля = "Бренд" Тогда
			Наименование = Наименование + " " + Номенклатура.Бренд;	
		ИначеЕсли Элемент.НаименованиеПоля = "Категория" Тогда
			Наименование = Наименование + " " + Номенклатура.object;	
		ИначеЕсли Элемент.НаименованиеПоля = "Артикул поставщика" Тогда
			Наименование = Наименование + " " + Номенклатура.vendorCode;	
		ИначеЕсли Элемент.НаименованиеПоля = "Код" Тогда	
			Наименование = Наименование + " " + СтрЗаменить(Номенклатура.Код, Символы.НПП, "");
		ИначеЕсли Элемент.НаименованиеПоля = "Размер" Тогда
			
			Если ИспользоватьВНаименованииРоссийскийРазмер Тогда
				НаименованиеРазмера = Размер.wbSize;	
			Иначе
				НаименованиеРазмера = Размер.techSize;	
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(НаименованиеРазмера) Или СокрЛП(НаименованиеРазмера) = "0" Тогда
				НаименованиеРазмера = Размер.Наименование;	
			КонецЕсли;
			
			Наименование = Наименование + " " + НаименованиеРазмера;
				
		Иначе
			
			Для Каждого Строка Из Характеристки Цикл
				
				Если Строка(Строка.Поле) = Элемент.НаименованиеПоля Тогда
					Наименование = Наименование + " " + Строка.Значение;		
				КонецЕсли;	
				
			КонецЦикла;	
			
		КонецЕсли;	
		
	КонецЦикла;	
	
	Возврат Наименование;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 02.08.24 УА #80685

//+ ИнфоСофт Сумин Д.В. 22.02.23 УА #55507
&НаСервере
Процедура ЗаполнитьТЧДанных(Элемент, НаименованиеНоменклатуры, НаименованиеХарактеристики = Неопределено) 
	
	ЭлементТЧ = Объект.ДанныеДляСозданияНоменклатуры.Добавить();
	ЭлементТЧ.НоменклатураWB = Элемент.НоменклатураВБ;
	ЭлементТЧ.РазмерНоменклатуры = Элемент.РазмерНоменклатуры;
	ЭлементТЧ.НаименованиеНоменклатуры = НаименованиеНоменклатуры;
	ЭлементТЧ.НаименованиеХарактеристики = НаименованиеХарактеристики; 
	ЭлементТЧ.Категория = Элемент.НоменклатураВБ.object;
	ЭлементТЧ.Штрихкод = Элемент.Штрихкод;
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 22.02.23 УА #55507

#КонецОбласти

#Область СозданияНоменклатуры  

//+ ИнфоСофт Сумин Д.В. 22.02.23 УА #55507
&НаСервере
Функция СоздатьНоменклатуруБезХарактеристик()   
		
	Счетчик = 0;
	
	Для Каждого Элемент Из Объект.ДанныеДляСозданияНоменклатуры Цикл 
		
		Попытка
			Номенклатура = СоздатьНоменклатуруНаСервере(Элемент);
		Исключение
			Текст = СтрШаблон("Номенклатура не создана %1 %2", Элемент.НаименованиеНоменклатуры, 
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
			Продолжить;
		КонецПопытки;
		
		Если СоздаватьШтрихкодыНоменклатуры Тогда
			СоздатьЗаписьВРегистрШтрихкодов(Номенклатура, Элемент); 	
		КонецЕсли;
		
		СоздатьЗаписьВРегистрСоответсвийРазмеров(Номенклатура, Элемент.РазмерНоменклатуры);
			
		Счетчик = Счетчик + 1;
		
	КонецЦикла;	 
	
	Объект.ДанныеДляСозданияНоменклатуры.Очистить();
	
	Возврат Счетчик;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 22.02.23 УА #55507

//+ ИнфоСофт Сумин Д.В. 22.02.23 УА #55507
&НаСервере
Функция СоздатьНоменклатуруСХарактеристиками()   
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Данные.НоменклатураWB КАК НоменклатураWB,
	|	Данные.РазмерНоменклатуры КАК РазмерНоменклатуры,
	|	Данные.НаименованиеНоменклатуры КАК НаименованиеНоменклатуры,
	|	Данные.НаименованиеХарактеристики КАК НаименованиеХарактеристики,
	|	Данные.Штрихкод КАК Штрихкод
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	&Данные КАК Данные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.НоменклатураWB КАК НоменклатураWB,
	|	ВТ_Данные.РазмерНоменклатуры КАК РазмерНоменклатуры,
	|	ВТ_Данные.НаименованиеНоменклатуры КАК НаименованиеНоменклатуры,
	|	ВТ_Данные.НаименованиеХарактеристики КАК НаименованиеХарактеристики,
	|	ВТ_Данные.Штрихкод КАК Штрихкод
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|ИТОГИ ПО
	|	НоменклатураWB,
	|	НаименованиеНоменклатуры";
	
	Запрос.УстановитьПараметр("Данные", Объект.ДанныеДляСозданияНоменклатуры.Выгрузить());
	
	РезультатЗапроса = запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
	Счетчик = 0; 
		
	Пока Выборка.Следующий() Цикл
		
		ВыборкаНаименование = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаНаименование.Следующий() Цикл
			
			Попытка
				Номенклатура = СоздатьНоменклатуруНаСервере(ВыборкаНаименование);
			Исключение
				Текст = СтрШаблон("Номенклатура не создана %1 %2", ВыборкаНаименование, 
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);	
				Продолжить;	
			КонецПопытки;	
			
			ВыборкаХарактеристика = ВыборкаНаименование.Выбрать();
			
			Пока ВыборкаХарактеристика.Следующий() Цикл
				
				Характеристика = СоздатьХарактеристикуУТНаСервере(Номенклатура, ВыборкаХарактеристика.НаименованиеХарактеристики); 
				
				Если СоздаватьШтрихкодыНоменклатуры Тогда
					СоздатьЗаписьВРегистрШтрихкодов(Номенклатура, ВыборкаХарактеристика, Характеристика); 	
				КонецЕсли;
				
				СоздатьЗаписьВРегистрСоответсвийРазмеров(Номенклатура, ВыборкаХарактеристика.РазмерНоменклатуры, Характеристика);
							
				Счетчик = Счетчик + 1;
				
			КонецЦикла;	
			
		КонецЦикла;	
		
	КонецЦикла; 
	
	Объект.ДанныеДляСозданияНоменклатуры.Очистить();
	
	Возврат Счетчик;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 22.02.23 УА #55507

//+ ИнфоСофт Сумин Д.В. 22.02.23 УА #55507
&НаСервере
Функция СоздатьНоменклатуруНаСервере(Элемент)
	
	НоменклатураСсылка = Справочники.Номенклатура.НайтиПоНаименованию(Элемент.НаименованиеНоменклатуры, Истина);
	
	Если ЗначениеЗаполнено(НоменклатураСсылка) Тогда 
		Номенклатура = НоменклатураСсылка.ПолучитьОбъект();		
	Иначе	
		Номенклатура = Справочники.Номенклатура.СоздатьЭлемент();
	КонецЕсли;
	
	Номенклатура.Родитель 						= НоменклатурнаяГруппа;
	Номенклатура.Артикул 						= Элемент.НоменклатураWB.VendorCode;
	Номенклатура.ВидНоменклатуры 				= ВидНоменклатуры;
	Номенклатура.Наименование 					= Элемент.НаименованиеНоменклатуры;
	Номенклатура.ЕдиницаИзмерения 				= ЕдиницаИзмерения;
	Номенклатура.НаименованиеПолное 			= Элемент.НаименованиеНоменклатуры; 
	
	Номенклатура.СтавкаНДС 						= СтавкаНДС_Справочник;
	Номенклатура.ТипНоменклатуры 				= ТипНоменклатуры;
	Номенклатура.ОсобенностьУчета 				= ОсобенностьУчета;
	Номенклатура.Качество 						= Перечисления.ГрадацииКачества.Новый;
	Номенклатура.ГруппаДоступа 					= Справочники.ГруппыДоступаНоменклатуры.НайтиПоНаименованию("Прочее"); 
	Номенклатура.ВариантОформленияПродажи 		= Перечисления.ВариантыОформленияПродажи.РеализацияТоваровУслуг;
	
	Если СоздаватьХарактеристики Тогда	
		Номенклатура.ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры;   		
	Иначе
		Номенклатура.ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать;  		
	КонецЕсли;	
	
	Номенклатура.Записать();
	
	Возврат Номенклатура.Ссылка;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 22.02.23 УА #55507

//+ ИнфоСофт Сумин Д.В. 22.02.23 УА #55507
&НаСервере
Функция СоздатьХарактеристикуУТНаСервере(Владелец, Наименование) 
	
	Характеристика = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент(); 
	Характеристика.Владелец = Владелец.Ссылка;
	Характеристика.Наименование = Наименование;
	Характеристика.НаименованиеПолное = Наименование;
	Характеристика.ВидНоменклатуры = ВидНоменклатуры;
	Характеристика.Записать();
	
	Возврат Характеристика.Ссылка;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 22.02.23 УА #55507 

#КонецОбласти 

//+ ИнфоСофт Сумин Д.В. 22.02.23 УА #55507
&НаКлиенте
Процедура СоздаватьШтрихкодыНоменклатурыПриИзменении(Элемент)  
	Если СоздаватьШтрихкодыНоменклатуры Тогда
		Элементы.ДанныеДляСозданияНоменклатурыШтрихкод.Видимость = Истина;	
	Иначе
		Элементы.ДанныеДляСозданияНоменклатурыШтрихкод.Видимость = Ложь;	
	КонецЕсли;
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 22.02.23 УА #55507

//+ ИнфоСофт Сумин Д.В. 22.02.23 УА #55507
&НаСервере
Функция ПроверкаЗаполненияНаПустыеЗначения()
	
	СтруктураПроверки = Новый Структура;
	СтруктураПроверки.Вставить("ПустыеЗначения", Ложь);
	
	Если Не ЗначениеЗаполнено(ЕдиницаИзмерения) Или Не ЗначениеЗаполнено(ВидНоменклатуры) Или Не ЗначениеЗаполнено(ОсобенностьУчета) Или Не ЗначениеЗаполнено(ТипНоменклатуры)
		Или Не ЗначениеЗаполнено(НоменклатурнаяГруппа) Тогда 
		Текст = "Необходимо заполнить настройки создания номенклатуры.";
		СтруктураПроверки.Вставить("Текст", Текст);
		СтруктураПроверки.Вставить("ПустыеЗначения", Истина);
		Возврат СтруктураПроверки;
	КонецЕсли;	
		
	
	Для Каждого Элемент Из Объект.ДанныеДляСозданияНоменклатуры Цикл
		
		Если Не ЗначениеЗаполнено(Элемент.НаименованиеНоменклатуры) Тогда
			Текст = "В строке номер: " + Элемент.НомерСтроки + " не заполнено ""Наименование номенклатуры"". Удалите строку или заполните данные.";
			СтруктураПроверки.Вставить("Текст", Текст);
			СтруктураПроверки.Вставить("ПустыеЗначения", Истина);
			Возврат СтруктураПроверки;	
		КонецЕсли; 
		
		Если СоздаватьХарактеристики Тогда 
			
			Если Не ЗначениеЗаполнено(Элемент.НаименованиеХарактеристики) Тогда
				Текст = "В строке номер: " + Элемент.НомерСтроки + " не заполнено ""Наименование характеристики"". Удалите строку или заполните данные.";
				СтруктураПроверки.Вставить("Текст", Текст);
				СтруктураПроверки.Вставить("ПустыеЗначения", Истина);
				Возврат СтруктураПроверки;	
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла; 
	
	Возврат СтруктураПроверки; 
	
КонецФункции //- ИнфоСофт Сумин Д.В. 22.02.23 УА #55507 

//+ ИнфоСофт Сумин Д.В. 22.02.23 УА #55507
&НаКлиенте
Процедура НоменклатурнаяГруппаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь;
	ПараметрыВыбора = Новый Структура("РежимВыбора",Истина);
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбораГруппы", ПараметрыВыбора, ЭтотОбъект); 
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 22.02.23 УА #55507

//+ ИнфоСофт Сумин Д.В. 22.02.23 УА #55507
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора) 
	
	Если ИсточникВыбора.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаВыбораГруппы" Или ИсточникВыбора.ИмяФормы = "Справочник.Номенклатура.ФормаВыбораГруппы" Тогда
		НоменклатурнаяГруппа = ВыбранноеЗначение;  
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 22.02.23 УА #55507  

//+ ИнфоСофт Мурсалимов Д.Р. 16.01.25 УА #91310
&НаСервере
Процедура СоздатьЗаписьВРегистрСоответсвийРазмеров(Номенклатура, РазмерWB, Характеристика = Неопределено)
	
	Попытка
		ИС_WB_Сервер.ДобавитьСоответствиеРазмеров(Профиль, РазмерWB, Номенклатура, Характеристика, ЕдиницаИзмерения);
	Исключение 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));	
	КонецПопытки;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 16.01.25 УА #91310  

//+ ИнфоСофт Сумин Д.В. 22.02.23 УА #55507
&НаКлиенте
Процедура СоздаватьХарактеристикиПриИзменении(Элемент) 
	
	Если СоздаватьХарактеристики Тогда
		Элементы.ДанныеДляСозданияНоменклатурыНаименвоаниеХарактеристики.Видимость = Истина;
		
	Иначе
		Элементы.ДанныеДляСозданияНоменклатурыНаименвоаниеХарактеристики.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 22.02.23 УА #55507

//+ ИнфоСофт Сумин Д.В. 22.02.23 УА #55507
&НаСервере
Процедура СоздатьЗаписьВРегистрШтрихкодов(Номенклатура, Элемент, Характеристика = Неопределено) 
	
	Попытка
		МенеджерЗаписи = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Номенклатура = Номенклатура; 
		МенеджерЗаписи.Характеристика = Характеристика;
		МенеджерЗаписи.Упаковка = Номенклатура.ЕдиницаИзмерения;
		МенеджерЗаписи.Штрихкод = Элемент.Штрихкод;
			
		МенеджерЗаписи.Записать(); 
		
	Исключение 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));	
	КонецПопытки;
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 22.02.23 УА #55507

//+ ИнфоСофт Ивонин К.А. 02.08.24 УА #80685
&НаСервере   
Процедура ЗаполнитьСписокВыбораФормированияНаименования()
	
	Элементы.НоменклатураНаименованиеПоля.СписокВыбора.Добавить("Наименование");
	Элементы.НоменклатураНаименованиеПоля.СписокВыбора.Добавить("Бренд");
	Элементы.НоменклатураНаименованиеПоля.СписокВыбора.Добавить("Категория");
	Элементы.НоменклатураНаименованиеПоля.СписокВыбора.Добавить("Артикул поставщика");
	Элементы.НоменклатураНаименованиеПоля.СписокВыбора.Добавить("Код");
	Элементы.НоменклатураНаименованиеПоля.СписокВыбора.Добавить("Размер");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_ХарактеристикиКатегорий.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ИС_WB_ХарактеристикиКатегорий КАК ИС_WB_ХарактеристикиКатегорий";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаХарактеристик = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаХарактеристик.Следующий() Цикл
		Элементы.НоменклатураНаименованиеПоля.СписокВыбора.Добавить(ВыборкаХарактеристик.Наименование);
	КонецЦикла;
	
	НоваяСтрока = Объект.Номенклатура.Добавить();
	НоваяСтрока.НаименованиеПоля = "Наименование";
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 02.08.24 УА #80685

#КонецОбласти
